{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "name": "input_4", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 512}, "inbound_nodes": [[["input_4", 0, 0]]], "name": "dense_5"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["dense_5", 0, 0]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_6"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dense_6", 0, 0]]], "name": "activation_2"}], "input_layers": [["input_4", 0, 0]], "output_layers": [["activation_2", 0, 0]], "name": "model_2"}}