{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 28, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "lstm_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}, "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}